In [2]:
import pandas as pd
pd.__version__

'1.1.5'

In [3]:
# Create pandas DataFrame from List
technologies = [ 
    ["Spark",20000, "30days"], 
    ["pandas",20000, "40days"], 
]
df = pd.DataFrame(technologies)
print(df)

        0      1       2
0   Spark  20000  30days
1  pandas  20000  40days

In [4]:
# Add Column & Row Labels to the DataFrame
column_names = ["Courses","Fee","Duration"]
row_label = ["a","b"]
df = pd.DataFrame(technologies,columns=column_names,index=row_label)
print(df)

  Courses    Fee Duration
a   Spark  20000   30days
b  pandas  20000   40days

In [5]:
# Show the data type of each column
df.dtypes

Courses     object
Fee          int64
Duration    object
dtype: object

In [6]:
# Show the data shape of the data frame
df.shape

(2, 3)

In [7]:
# set custom types to DataFrame
types={'Courses': str, 'Fee':float, 'Duration':str}
df = df.astype(types)
df.dtypes

Courses      object
Fee         float64
Duration     object
dtype: object

In [8]:
# Create DataFrame from Dictionary
technologies = {
    'Courses':["Spark","PySpark","Hadoop"],
    'Fee' :[20000,25000,26000],
    'Duration':['30day','40days','35days'],
    'Discount':[1000,2300,1500]
}
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Hadoop  26000   35days      1500

In [9]:
# Create DataFrame from CSV file
df = pd.read_csv('project.csv', index_col=0)
print(df)

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

In [10]:
# Create DataFrame with None/Null to work with examples
import pandas as pd
import numpy as np
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          })
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
df = pd.DataFrame(technologies, index=row_labels)
print(df)

    Courses      Fee Duration  Discount
r0    Spark  22000.0    30day      1000
r1  PySpark  25000.0   50days      2300
r2   Hadoop  23000.0   55days      1000
r3   Python  24000.0   40days      1200
r4   Pandas      NaN   60days      2500
r5     None  25000.0    35day      1300
r6    Spark  25000.0               1400
r7   Python  22000.0   50days      1600

### DataFrame properties

In [11]:
df.shape

(8, 4)

In [12]:
df.size

32

In [13]:
df.empty

False

In [14]:
df.columns

Index(['Courses', 'Fee', 'Duration', 'Discount'], dtype='object')

In [15]:
df.columns.values

array(['Courses', 'Fee', 'Duration', 'Discount'], dtype=object)

In [16]:
df.index

Index(['r0', 'r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7'], dtype='object')

In [17]:
df.index.values

array(['r0', 'r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7'], dtype=object)

In [18]:
df.dtypes

Courses      object
Fee         float64
Duration     object
Discount      int64
dtype: object

In [19]:
df[['Fee','Duration']]

        Fee Duration
r0  22000.0    30day
r1  25000.0   50days
r2  23000.0   55days
r3  24000.0   40days
r4      NaN   60days
r5  25000.0    35day
r6  25000.0
r7  22000.0   50days

In [21]:
df2 = df['Fee']
df2

r0    22000.0
r1    25000.0
r2    23000.0
r3    24000.0
r4        NaN
r5    25000.0
r6    25000.0
r7    22000.0
Name: Fee, dtype: float64

In [45]:
# Selection by callable
df['Fee'].loc[lambda s: s >= 23000]

r1    25000.0
r2    23000.0
r3    24000.0
r5    25000.0
r6    25000.0
Name: Fee, dtype: float64

In [51]:
df2 = df[df['Fee'] > 22000][['Courses', 'Fee', 'Discount']]
df2

    Courses      Fee  Discount
r1  PySpark  25000.0      2300
r2   Hadoop  23000.0      1000
r3   Python  24000.0      1200
r5     None  25000.0      1300
r6    Spark  25000.0      1400

In [32]:
# Select via integer slicing:
df2 = df.iloc[6:,1:4]
df2

        Fee Duration  Discount
r6  25000.0               1400
r7  22000.0   50days      1600

In [34]:
# Select via integer list:
df2 = df.iloc[[1, 3, 5], [1, 3]]
df2

        Fee  Discount
r1  25000.0      2300
r3  24000.0      1200
r5  25000.0      1300

In [37]:
# Slicing ranges
df[6:1:-1]

   Courses      Fee Duration  Discount
r6   Spark  25000.0               1400
r5    None  25000.0    35day      1300
r4  Pandas      NaN   60days      2500
r3  Python  24000.0   40days      1200
r2  Hadoop  23000.0   55days      1000

In [42]:
# Selection by label slicing
df.loc['r2':'r4','Courses':'Duration']

   Courses      Fee Duration
r2  Hadoop  23000.0   55days
r3  Python  24000.0   40days
r4  Pandas      NaN   60days

In [54]:
# Selecting random samples
df.sample(n=3)

   Courses      Fee Duration  Discount
r3  Python  24000.0   40days      1200
r4  Pandas      NaN   60days      2500
r7  Python  22000.0   50days      1600

In [57]:
# Selecting random samples with weights
weights = [0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.2, 0.2]
df.sample(n=3, weights=weights)

    Courses      Fee Duration  Discount
r7   Python  22000.0   50days      1600
r6    Spark  25000.0               1400
r1  PySpark  25000.0   50days      2300

### Matching / broadcasting behavior

In [58]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a  0.478350  1.272377       NaN
b -0.677155  0.936184 -1.444619
c -0.037804  0.480838 -0.513246
d       NaN -0.094179 -1.156965

In [60]:
row = df.iloc[1]
row

one     -0.677155
two      0.936184
three   -1.444619
Name: b, dtype: float64

In [61]:
column = df["two"]
column

a    1.272377
b    0.936184
c    0.480838
d   -0.094179
Name: two, dtype: float64

In [62]:
df.sub(row, axis="columns")

        one       two     three
a  1.155505  0.336193       NaN
b  0.000000  0.000000  0.000000
c  0.639351 -0.455346  0.931373
d       NaN -1.030363  0.287654

In [64]:
df.sub(row, axis=1)

        one       two     three
a  1.155505  0.336193       NaN
b  0.000000  0.000000  0.000000
c  0.639351 -0.455346  0.931373
d       NaN -1.030363  0.287654

In [65]:
df.sub(column, axis="index")

        one  two     three
a -0.794027  0.0       NaN
b -1.613339  0.0 -2.380803
c -0.518642  0.0 -0.994084
d       NaN  0.0 -1.062786

In [66]:
df.sub(column, axis=0)

        one  two     three
a -0.794027  0.0       NaN
b -1.613339  0.0 -2.380803
c -0.518642  0.0 -0.994084
d       NaN  0.0 -1.062786

### A level of a MultiIndexed DataFrame with a Series.

In [67]:
dfmi = df.copy()
dfmi.index = pd.MultiIndex.from_tuples(
    [(1, "a"), (1, "b"), (1, "c"), (2, "a")], names=["first", "second"]
)
dfmi

                   one       two     three
first second
1     a       0.478350  1.272377       NaN
      b      -0.677155  0.936184 -1.444619
      c      -0.037804  0.480838 -0.513246
2     a            NaN -0.094179 -1.156965

In [68]:
dfmi.sub(column, axis=0, level="second")

                   one       two     three
first second
1     a      -0.794027  0.000000       NaN
      b      -1.613339  0.000000 -2.380803
      c      -0.518642  0.000000 -0.994084
2     a            NaN -1.366556 -2.429341

### Combining overlapping data sets

In [69]:
df1 = pd.DataFrame(
    {"A": [1.0, np.nan, 3.0, 5.0, np.nan], "B": [np.nan, 2.0, 3.0, np.nan, 6.0]}
)
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [70]:
df2 = pd.DataFrame(
    {
        "A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],
        "B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],
    }
)
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [71]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

In [72]:
def combiner(x, y):
    return np.where(pd.isna(x), y, x)

In [73]:
df1.combine(df2, combiner)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

### Descriptive statistics

In [74]:
df

        one       two     three
a  0.478350  1.272377       NaN
b -0.677155  0.936184 -1.444619
c -0.037804  0.480838 -0.513246
d       NaN -0.094179 -1.156965

In [75]:
df.mean(0)

one     -0.078870
two      0.648805
three   -1.038277
dtype: float64

In [76]:
df.mean(1)

a    0.875363
b   -0.395197
c   -0.023404
d   -0.625572
dtype: float64

In [77]:
df.sum(0, skipna=False)

one          NaN
two      2.59522
three        NaN
dtype: float64

In [78]:
df.sum(axis=1, skipna=True)

a    1.750726
b   -1.185590
c   -0.070212
d   -1.251144
dtype: float64

In [79]:
ts_stand = (df - df.mean()) / df.std()
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [80]:
df.mean()

one     -0.078870
two      0.648805
three   -1.038277
dtype: float64

In [81]:
df

        one       two     three
a  0.478350  1.272377       NaN
b -0.677155  0.936184 -1.444619
c -0.037804  0.480838 -0.513246
d       NaN -0.094179 -1.156965

In [82]:
df - df.mean()

        one       two     three
a  0.557219  0.623572       NaN
b -0.598285  0.287379 -0.406342
c  0.041066 -0.167967  0.525030
d       NaN -0.742984 -0.118688

In [83]:
df.std()

one      0.578846
two      0.592077
three    0.476895
dtype: float64

In [84]:
xs_stand = df.sub(df.mean(1), axis=0).div(df.std(1), axis=0)
xs_stand.std(1)

a    1.0
b    1.0
c    1.0
d    1.0
dtype: float64

In [85]:
df.sub(df.mean(1), axis=0)

        one       two     three
a -0.397013  0.397013       NaN
b -0.281958  1.331381 -1.049422
c -0.014400  0.504242 -0.489842
d       NaN  0.531393 -0.531393

In [86]:
import numpy as np

In [87]:
np.mean(df["one"])

-0.07886976046097754

In [88]:
np.mean(df["one"].to_numpy())

nan

In [89]:
df["one"].to_numpy()

array([ 0.47834972, -0.67715501, -0.03780399,         nan])

In [90]:
# Describe dataframe
df.describe()

            one       two     three
count  3.000000  4.000000  3.000000
mean  -0.078870  0.648805 -1.038277
std    0.578846  0.592077  0.476895
min   -0.677155 -0.094179 -1.444619
25%   -0.357480  0.337084 -1.300792
50%   -0.037804  0.708511 -1.156965
75%    0.220273  1.020232 -0.835105
max    0.478350  1.272377 -0.513246